FROM golang:1.22-alpine

#Использует образ golang:1.22-alpine в качестве основы. golang - это официальный образ Go от Docker,
#а 1.22-alpine - версия Go (1.22) и дистрибутив Linux (Alpine Linux). Alpine - минимальный дистрибутив,
#который делает образ Docker меньше.

ENV GOPATH=/
#Устанавливает переменную среды

RUN apk update && apk add git bash
#Обновляет пакетный менеджер Alpine (apk) и устанавливает git и bash - инструменты, которые могут понадобиться для разработки.

WORKDIR /go-unarchive
#Устанавливает рабочую директорию в контейнере как /app

COPY . .
#Копирует все файлы из текущей директории (.) в рабочую директорию контейнера (/app).

RUN go mod download
#Скачивает зависимости проекта, указанные в go.mod.

RUN go build -o go-unarchive ./cmd/main.go
#Строит ваше Go-приложение и сохраняет его в файл app.

#EXPOSE 8080
#Открывает порт 8080 в контейнере (если ваше приложение работает на этом порту).

CMD ["./go-unarchive"]
# Запускает приложение
